<template>
    <div class="toolbar">
        <div class="info">神思读卡器测试 V{{ version }}</div>
        <div class="button fix" @click="fix" style="margin-left: auto;" :style="computeFixedStyle">
            <svg t="1716053271013" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
                p-id="25921" width="17">
                <path
                    d="M706.081047 78.192364c2.699736 0 4.899522 0 9.399082 4.39957 3.999609 4.0996 4.39957 6.399375 4.39957 9.399083 0 3.099697-0.299971 5.299482-4.49956 9.599062-0.999902 1.099893-1.999805 1.899814-2.999707 2.499756-43.995704 30.197051-70.193145 79.592227-70.193146 132.187091v2.099795c0 123.787911 42.795821 244.576116 120.488234 340.166781 0.399961 0.499951 0.699932 0.899912 1.099893 1.399863 17.09833 21.497901 27.597305 44.395664 31.696904 69.393223h-566.944634c4.0996-24.997559 14.598574-47.895323 31.596914-69.293233 0.19998-0.299971 0.399961-0.599941 0.699932-0.799922 77.992384-96.290597 120.988185-217.278781 120.988185-340.766722v-2.299775c0-52.594864-26.297432-101.99004-70.293136-132.187091-0.999902-0.699932-2.099795-1.599844-3.199687-2.699737-3.999609-3.999609-4.29958-6.299385-4.29958-9.299091 0-3.099697 0.299971-5.299482 4.39957-9.499073 3.999609-3.999609 6.299385-4.29958 9.299092-4.29958h388.362074m0-63.993751H317.718973c-21.09794 0-39.396153 7.799238-54.694659 23.097745-15.298506 15.498486-22.997754 33.596719-22.997754 54.694659s7.799238 39.396153 23.097744 54.694658c3.899619 3.799629 7.899229 7.199297 12.098819 10.099014 26.297432 18.098233 42.49585 47.495362 42.49585 79.492237v2.299775C317.718973 347.966019 279.922664 453.955668 211.029392 538.947368c-0.299971 0.399961-0.599941 0.799922-0.999903 1.199883-31.796895 39.896104-47.595352 84.691729-47.595352 134.386877 0 10.498975 3.799629 19.598086 11.498877 27.297334 7.599258 7.699248 16.79836 11.498877 27.297335 11.498877h245.076066l46.095499 294.371253c1.999805 10.898936 8.49917 16.298408 19.398106 16.298408h0.599941c4.799531 0 8.999121-1.599844 12.398789-4.999512 3.499658-3.299678 5.699443-7.599258 6.399375-12.398789l31.096963-293.17137h260.374573c10.498975 0 19.598086-3.799629 27.297334-11.498877 7.699248-7.599258 11.498877-16.79836 11.498877-27.297334 0-49.895127-15.898447-94.690753-47.695342-134.586857-0.499951-0.599941-0.999902-1.299873-1.499853-1.899814-68.893272-84.691729-106.18963-190.681379-106.18963-299.770726v-2.099795c0-31.896885 16.098428-61.394004 42.39586-79.392247 4.29958-2.899717 8.29919-6.299385 12.198808-10.298994 15.398496-15.498486 23.097744-33.596719 23.097745-54.694659s-7.799238-39.296162-23.097745-54.694658c-15.398496-15.298506-33.496729-22.997754-54.594668-22.997755z"
                    fill="#ffffff" p-id="25922"></path>
            </svg>
        </div>
        <div class="button minimize" @click="minimize">
            <svg t="1716051332003" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
                p-id="7504" width="17">
                <path
                    d="M808.32 516.736a38.4 38.4 0 0 0 41.6-41.6 38.4 38.4 0 0 0-41.6-41.6H212.736a38.4 38.4 0 0 0-41.6 41.6 41.088 41.088 0 0 0 12.8 32 48.896 48.896 0 0 0 32 12.8z"
                    fill="#ffffff" p-id="7505"></path>
            </svg>
        </div>
        <div class="button maxmize" @click="maxmize">
            <svg t="1716053224299" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
                p-id="24867" width="17">
                <path
                    d="M819.2 204.8v614.4H204.8V204.8h614.4m68.266667-68.266667H136.533333v750.933334h750.933334V136.533333z"
                    fill="#ffffff" p-id="24868"></path>
            </svg>
        </div>
        <div class="button close" @click="close">
            <svg t="1716052851509" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
                p-id="23065" width="17">
                <path
                    d="M897.6 183.5L183 898.1c-7.5 7.5-19.6 7.5-27.1 0l-29.5-29.5c-7.5-7.5-7.5-19.6 0-27.1L841 126.9c7.5-7.5 19.6-7.5 27.1 0l29.5 29.5c7.5 7.4 7.5 19.6 0 27.1z"
                    fill="#ffffff" p-id="23066"></path>
                <path
                    d="M183 126.9l714.7 714.7c7.5 7.5 7.5 19.6 0 27.1l-29.5 29.5c-7.5 7.5-19.6 7.5-27.1 0L126.4 183.5c-7.5-7.5-7.5-19.6 0-27.1l29.5-29.5c7.4-7.5 19.6-7.5 27.1 0z"
                    fill="#ffffff" p-id="23067"></path>
            </svg>
        </div>
    </div>
</template>
<script setup>
import { onMounted, ref, computed } from 'vue';
let version = ref('0.0.0');
let fixed = ref(false);
onMounted(() => {
    window.electron.getAppVersion().then((result) => {
        console.log(result);
        version.value = result;
    });
});
const fix = () => {
    console.log('fix');
    window.electron.toggleWindow();
    fixed.value = !fixed.value;
}
const minimize = () => {
    console.log('minimize');
    window.electron.minimizeWindow();
}
const maxmize = () => {
    console.log('maxmize');
    window.electron.maximizeWindow();
}
const close = () => {
    window.electron.exitApp();
}
const computeFixedStyle = computed(() => {
    if (fixed.value) {
        return { backgroundColor: '#005377' }
    }
})
</script>
<style scoped>
.info {
    margin-left: 8px;
    font-size: 14px;
    color: white;
    margin-bottom: 2px;
    white-space: nowrap;
    text-overflow: ellipsis;
    overflow: hidden;
    user-select: none;
}

.toolbar {
    display: flex;
    flex-direction: row;
    align-items: center;
    height: auto;
    background-color: #006c97;
    -webkit-app-region: drag;
    z-index: 9999 !important;
    overflow: hidden;
    user-select: none;
}

.button {
    padding: 1vh 2vw;
    -webkit-app-region: no-drag;
    display: flex;
    max-width: 20vw;
}

.button:hover {
    background-color: #2297c9;
}
</style>